{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hithere",
                "Howareyou",
                "Isanyonethere ?",
                "Hey",
                "Hola",
                "Hello",
                "Goodday",
                "မင်္ဂလာ ပါ"
            ],
            "responses": [
                "မင်္ဂလာပါ ခင်ဗျာ",
                "မင်္ဂလာပါ",
                "မင်္ဂလာပါ ဘာ ကူညီ ပေး ရ မလဲ။",
                "မင်္ဂလာပါ! ကျွန်တော်က တော့ BotTUM ဖြစ်ပါတယ်။ TUM နဲ့ပါတ်သတ်၍ Information တွေကို ဖြေကြား ပေးနိုင်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "explain",
            "patterns": [
                "BotTUM ဆို တာ ဘာ လဲ ။",
                "BotTUM အကြောင်းရှင်းပြ ပါ",
                "ဘာ တွေေမေး လို့ ရ လဲ"
            ],
            "responses": [
                "မင်္ဂလာပါ! ကျွန်တော်က တော့ BotTUM ဖြစ်ပါတယ်။ TUM ရဲံ ကျောင်း campus နဲ့ ပါတ်သတ်သော Information တွေကို ဖြေကြား ပေးနိုင်ပါတယ်။ အသေးစိတ်သိရှိလိုသည်များကို ကျောင်းသားရေးရာ ဖုန်းနံပါတ် ၀၉-၉၈၈၄၈၄၁၇၂ ကို ဆက်သွယ်၍ အသေးစိတ်ကို မေးမြန်း နိုင်ပါတယ် ။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Student_Affair",
            "patterns": [
                "ကျောင်းသား ရေးရာ ဖုန်း နံပါတ် လေး သိ ချင် ပါ တယ် ။",
                "ကျောင်းသား ရေးရာ ဖုန်း နံပါတ် ကို ပြော ပြ ပါ ။",
                "ကျောင်းသား ရေးရာ ဖုန်း"
            ],
            "responses": [
                " ကျောင်းသားရေးရာ ဖုန်းနံပါတ် မှာ ၀၉-၉၈၈၄၈၄၁၇၂ ဖြစ်ပါတယ် ။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "Seeyoulater",
                "Goodbye",
                "Nicechattingtoyou",
                "bye",
                "Tillnexttime",
                "ကျေးဇူးတင် ပါ တယ်"
            ],
            "responses": [
                "See you!",
                "Have a nice day",
                "Bye! Come back again soon.",
                "ကျေးဇူးတင်ပါတယ်"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank You",
                "That'shelpful",
                "Awesome",
                "thanks",
                "Thanks forhelpingme",
                "O K"
            ],
            "responses": [
                "Happy to help!",
                "Any time!",
                "My pleasure"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "major",
            "patterns": [
                "Major",
                "မေဂျာ",
                "ဘာ Major တွေ ရှိ လဲ",
                "ဘာ မေဂျာ တွေ ရှိ လဲ",
                "Major အကြောင်း တွေ ရှင်းပြ ပေး ပါ",
                "ကျောင်း မှာ အဓိက မေဂျာ ဘယ် နှစ် ခု ရှိ ပါ သလဲ",
                "လူ ကြိုက် အများဆုံး မေဂျာ က ရော ဘာ ဖြစ် မလဲ"
            ],
            "responses": [
                "လက်ရှိ နည်းပညာတက္ကသိုလ် (မန္တလေး) တွင် သင်ကြားနေသော မေဂျာ (၁၀) ခု ရှိပါတယ်။ Civil Engineering၊ Architecture၊ Electronics Engineering၊ Electrical Power Engineering၊ Mechanical Engineering၊ Information Technology၊ Mechatronics Engineering၊ Chemical Engineering၊ Petroleum Engineering၊ Mining Engineering တို့ ရှိပါတယ်။ Civil၊ IT နှင့် Architecture တို့မှာ လူစိတ်ဝင်စားမှု မြင့်တက်နေသော မေဂျာများ ဖြစ်ကြောင်း ယူဆရပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "statue",
            "patterns": [
                "ကျောင်း ရဲ့ ရုပ်ထု ကြီး အကြောင်း က ဘာ လဲ",
                "ဦးရွှေရိုးရုပ်ထု အကြောင်း ပြော ပြ ပါ",
                "ကျောင်း ရှေ့ က ရုပ်ထု ကြီး က ဘာ လဲ"
            ],
            "responses": [
                "ကုန်းဘောင်ခေတ်နှောင်းပိုင်း မင်းတုန်းမင်း လက်ထက်တွင် ကနောင်မင်းသားကြီး ၏ အစီအစဉ်ဖြင့် မြန်မာ လူငယ်များကို နိုင်ငံရပ်ခြား တိုင်းပြည်များသို့ စေလွှတ် ပညာ သင် စေရာ ပထမဆုံး မြန်မာ လူမျိုး အင်ဂျင်နီယာ ဘွဲ့ ရ ဖြစ်သော ဦးရွှေအိုး ၏ ဂုဏ်ပြု ရုပ်ထု ဖြစ်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "about",
            "patterns": [
                "ကျောင်း ဘယ်နှ ခုနှစ် က ဖြစ် တည် လာ တာ လဲ",
                "ကျောင်း ဆို တာ ဘာ လဲ",
                "ကျောင်း အကြောင်း ပြော ပြ ပါ",
                "ကျောင်း ဘယ် နှစ် ခု နှစ် မှာ စတင် တည်ထောင် ခဲ့ သလဲ"
            ],
            "responses": [
                "နည်းပညာတက္ကသိုလ် (မန္တလေး) သည် မြန်မာနိုင်ငံရှိ အင်ဂျင်နီယာပိုင်းဆိုင်ရာ သက်တမ်းရင့်ကျောင်းများအနက် တစ်ခုအပါအဝင်ဖြစ်သည်။ အစိုးရစက်မှုလက်မှုသိပ္ပံ (မန္တလေး)ကို ၁၉၅၅ခုနှစ် ဒီဇင်ဘာ ၂၀ရက်နေ့တွင် ဝန်ကြီးချုပ်ဦးနုက ဖွင့်လှစ်ပေးခဲ့သည်။ ထိုစဉ်က ကျောင်း၏တည်နေရာမှာ ချမ်းအေးသာစံမြို့နယ်၊ လမ်း၃၀နှင့် ၃၁လမ်းကြား ၆၈လမ်းနှင့် လမ်း၇၀ကြားဖြစ်သည်။ ၁၉၉၉ခုနှစ် ဩဂုတ်လ ၂၀ရက်နေ့တွင် အစိုးရနည်းပညာကောလိပ်အဖြစ် တိုးမြှင့်ခဲ့သည်။ ၂၀၀၂ခုနှစ် အောက်တိုဘာ ၂၂ရက်နေ့တွင် မန္တလေးတောင်မြောက်ဘက် ပုသိမ်ကြီးမြို့နယ် လက်ရှိနေရာသို့ ပြောင်းရွှေ့ခဲ့ပြီး ၂၀၀၇ခုနှစ် ဇန်နဝါရီလ ၂၀ရက်နေ့တွင် နည်းပညာတက္ကသိုလ်(မန္တလေး)အဖြစ်အဆင့်မြှင့်တင်ဖွင့်လှစ်ခဲ့သည်။ လက်ရှိတည်နေရာသည် (၆၅.၃၇)ဧက ကျယ်ဝန်းသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "address",
            "patterns": [
                "ကျောင်း ဘယ် နေရာ မှာ တည်ရှိ တာ လဲ",
                "ကျောင်းလိပ်စာ ကို ပြော ပြ ပါ ။",
                "ကျောင်းလိပ်စာပြော ပြ ပါ ။",
                "ကျောင်း ဘယ် နားလေး မှာ လဲ",
                "ကျောင်းတည် နေရာ လိပ်စာ ကို ပြော ပြ ပါ ။"
            ],
            "responses": [
                "နည်းပညာတက္ကသိုလ် (မန္တလေး)သည် မန္တလေးတိုင်းဒေသကြီး၊ အောင်မြေသာစံခရိုင်၊ ပုသိမ်ကြီးမြို့နယ်၊ အောင်ချမ်းသာကျေးရွာတွင် တည်ရှိပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "requirements",
            "patterns": [
                "ကျောင်းအပ် ရင် ဘာ တွေ လိုအပ် ပါ သလဲ",
                "ကျောင်းအပ် ဖို့ ဘယ်လို တွေ ပြင်ဆင် ရ မလဲ",
                "ကျောင်းအပ် ခ ဘယ်လောက် ကုန်ကျ နိုင် သလဲ",
                "ကျောင်းအပ် ခ ဘယ်လောက် ကုန်ကျ ပါ သလဲ",
                "ကျောင်းလျှောက် ရ မဲ့ ပုံစံ က ရော ဘယ်လို သတ်မှတ် တာ လဲ",
                "ကျောင်းအပ် ရင် ဘာ တွေ လို လဲ",
                "ကျောင်းအပ် ဖို့ ဘာ တွေ လို လဲ"
            ],
            "responses": [
                "ကျောင်းအပ်လျှင် လိုအပ်သည်များမှာ (၁) ကျောင်းသား/သူ မှတ်ပုံတင် မိတ္ထူ၊ (၂) ဆယ်တန်းအောင်လက်မှတ်မိတ္ထူ ၊ (၃) အမှတ်စာရင်းမိတ္ထူ၊ (၄) ဓါတ်ပုံ ၅ ပုံ၊ (၅) မိဘ မှတ်ပုံတင်မိတ္ထူတို့ ဖြစ်ပါသည်။ ကျောင်းအပ်လျှင် (၄၀,၀၀၀)ကျပ် ဝန်းကျင်သာ ကျသင့်မည်ဖြစ်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "coe",
            "patterns": [
                "ကျောင်း က COEကျောင်း ဟုတ် သလား",
                "ကျောင်း က COEကျောင်း လား",
                "ISO က ဘာ လဲ",
                "ကျောင်း က COEကျောင်း ဖြစ် နိုင် ဘာ သလား",
                "ကျောင်း က COEကျောင်း ဆို တာ က ရော ဘာ လဲ"
            ],
            "responses": [
                "ISO ရ ထားပြီးသား ကျောင်း တစ်ကျောင်းတော့ ဖြစ်ပါတယ်။ COE ကျောင်း မဟုတ်ပါဘူး။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "transfer",
            "patterns": [
                "ကျောင်း တက် ပြီးနောက် ပိုင်း MTU ကို ပေါင်းကူးလုပ် လို့ ရ သေး သလား",
                "ကျောင်း က နေ မန္တလေး နည်း ပညာ တက္ကသိုလ် ကို ပေါင်းကူး ရ နိုင် ပါ သလား",
                "ကျောင်း ပေါင်းကူး တာ က GTI တွေ ကော ရ လား"
            ],
            "responses": [
                "အစိုးရစက်မှုလက်မှု သိပ္ပံမှ ကျောင်းသား/ကျောင်းသူများ အနေဖြင့်တော့ နည်းပညာတက္ကသိုလ်များသို့ ပေါင်းကူးတက်ရောက်နိုင်ပါသည်။ နည်းပညာတက္ကသိုလ်များသည် MTU နှင့် YTU မှ လွဲ၍ ကျန်သည့် နည်းပညာတက္ကသိုလ်များအား မိမိ၏ မေဂျာ ရှိလျှင် ပြောင်းရွှေ့နိုင်ပါသည်။ Master နှင့် Ph.D အတန်းများ ကိုတော့ ကျောင်းပြီးသွားပါက သွားရောက်တက်နိုင်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "activity",
            "patterns": [
                "ကျောင်းပြင် ပactivity တွေ ရော ရှိ သလား",
                "ကျောင်း Fieldtrip တွေ ဘာ တွေ ကော ရှိ သလား",
                "ကျောင်း တွင်း ပျော်ပွဲရွှင် ပွဲ တွေ က ဘာ တွေ ဘာ လဲ",
                "ကျောင်းပြင် ပactivity တွေ ရှိ လား",
                "ဘာ Event တွေ ရှိ သလဲ"
            ],
            "responses": [
                "ပထမ၊ ဒုတိယနှင့် တတိယနှစ်တွေကတော့ စာသင်နှစ် တနှစ် ပြီးတိုင်း လေ့လာရေး ခရီး သွားကြ ရပါတယ်။ ဒါ့အပြင် First semester တွင် မေဂျာ အသီးသီး ၏ welcome များ နှင့် The whole welcome၊ ကျောင်းသင်္ကြန်၊ Second Semester တွင် ဘောလုံးပြိုင်ပွဲ၊ အာစရိယပူဇော်ပွဲ များ ကျင်းပလေ့ ရှိပါသည်။ (ပြင်ပ လှုပ်ရှားမှုများ လည်း ရှိနိုင်ပါသည်)"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "teaching_Lab",
            "patterns": [
                "ကျောင်းစာ တွေ့ လက်တွေ့ သင်ကြား ရ ပါ သလား ဗျ",
                "Labခန်း တွေ ကော အသုံးပြု နိုင် ပါ သလား",
                "Assignment နဲ့ presentation တွေ ရော လုပ် ရ သလား"
            ],
            "responses": [
                "စာတွေ့ရော လက်တွေ့ရော သင်ကြားပေးပါသည်။ Lab Practical တွေကော Assignment တွေကော ရှိပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "teaching_Sub",
            "patterns": [
                "ဘယ် နှစ် ဘာသာ သင်ကြား ရ ပါ သလဲ"
            ],
            "responses": [
                "သင်ကြားရတဲ့ ဘာသာတွေကတော့ မေဂျာ ဘာသာရပ်ပေါ် မူတည်ပြီး ကွဲပြားနိုင်ပါတယ်။ အများအားဖြင့် ၇ ဘာသာ ရှိပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "teaching_Technique",
            "patterns": [
                "ဆရာ ၊ ဆရာမ တွေ ရဲ့ သင်ကြား ရေး က ရော ကျောင်းသား တွေ အတွက် လွယ် ကူ သလား"
            ],
            "responses": [
                "ဆရာ၊ ဆရာမ အများစုမှာ စိတ်ရင်းစေတနာ ကောင်းစွာ စာသင်ပေးကြပါသည်။ စာအသင်အပြ လည်း ကောင်းကြ ပါသည်။ စာသင်နှစ် တစ်နှစ် ပြီးတိုင်း ဆရာ၊ ဆရာမများ၏ စာသင်ကြားမှုနှင့် ပတ်သတ်၍ ကျောင်းသား၊ ကျောင်းသူများဆီမှ စစ်တမ်း ကောက်ယူမှု ပြုလုပ်ပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "hostel_Food",
            "patterns": [
                "ကျောင်း အဆောင် တွေ က ထမင်း ဟင်းစား ရိတ်ငြိမ်း သလား",
                "ကျောင်း အဆောင် မှာ ထမင်း ကျွေး ပါ သလား"
            ],
            "responses": [
                "ကျောင်း အဆောင်များ သည် ထမင်း ဟင်း စားရိတ်ငြိမ်း မဟုတ်ပါ။ သို့သော် ကျောင်းကန်တင်း မှ လွယ်ကူစွာ ဆက်သွယ် ဝယ်စားနိုင်ပါသည်။ ကျောင်းပြင်ပတွင် လည်း ထမင်းဆိုင် ကုန်စုံဆိုင်များ ပေါများစွာ ရှိပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "hostel",
            "patterns": [
                "ကျောင်း အဆောင် လျှောက် ရန် ဘာ တွေ လိုအပ် ပါ သလဲ",
                "ကျောင်း အဆောင် လျှောက် ဖို့ ဘာ တွေ လိုအပ် ပါ သလဲ ရှင့်",
                "ကျောင်း အဆောင် လခ ဘယ်လောက် ပါ လဲ",
                "ဘယ်သူ တွေ က ကျောင်း အဆောင် ကို လျောက် ထား နိုင် ပါ သလဲ"
            ],
            "responses": [
                "ကျောင်း အဆောင် လျှောက်ထားရန် လိုအပ်သည့် တို့မှာ\n (၁) မိဘ၊ ကျောင်းသား/သူ မှတ်ပုံတင် (မိတ္တူ)\n (၂) အိမ်ထောင်စု ဇယား မိတ္တူ\n တစ်လလျှင် (၅၀၀၀) ကျပ်သာ ကျသင့်မည် ဖြစ်ပြီး တစ်နှစ်ကို ကျောင်းတက်ကာလ ရှစ်လဖြစ်၍ စုစုပေါင်း မြန်မာငွေ (၄၀၀၀၀) ကျပ်သာ ကျသင့်ပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "activity_club",
            "patterns": [
                "TUM မှာ အနုပညာ စာပေ နဲ့ ပတ်သတ်ပီးclub တွေ မ ရှိ ဘူး လား ။",
                "ဘာactivityclub တွေ ရှိ သလဲ",
                "အနုပညာ အသင်း တွေ ရှိ ပါ သလား ။"
            ],
            "responses": [
                "အနုပညာ အသင်း တွေရှိ ပါတယ် ။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "internship",
            "patterns": [
                "ကျောင်း က နေ internshipဆင်း ရ တာ တွေ ရှိ လား ။",
                "Internshipဆင်း ရ လား ။"
            ],
            "responses": [
                "ပထမနှစ်၊ ဒုတိယနှစ်နှင့် တတိယနှစ်အတန်းများသည် Field ဆင်းရန် လိုအပ်ပြီး စတုတ္ထနှစ်နှင့် ပဥ္စမနှစ်အတန်းများကတော့ project လုပ်ရန် လိုအပ်ပါသည်။ နောက်ဆုံးနှစ် အတန်းများကတော့ Internship ဆင်းကြပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "enterance",
            "patterns": [
                "မည် သည့် ဘာသာရပ် တွေ ရဲ့ အမှတ် နဲ့ လျှောက်ခွင့် ပေး ပါ သလဲ",
                "ဝင်ခွင့် ဦးရေ ရော ဘယ်လို သတ်မှတ် ထား ပါ သလဲ"
            ],
            "responses": [
                "2023-2024 ခုနှစ် ပညာသင်နှစ် ၏ အချက်အလက် များ အရ သိပ္ပွံဘာသာတွဲ ဖြင့် English, Mathematics, Physics, Chemistry, (၄) ဘာသာ အမှတ်ပေါင်း အနည်းဆုံး 280 ရှိသောသူ ဖြစ် ရ ပါ မည်။ (၆) ဘာသာ အမှတ်ပေါင်း အနည်းဆုံး 420 ဖြစ် ရ ပါ မည်။ ၀င်ခွင့် ဦးရေ က တော့ အကြမ်းဖျင်း အားဖြင့် တစ်နှစ် ကို ကျောင်းသား ဦးရေ ၂၀၀ ခန့် ခေါ် ယူ ပါ တယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "chances",
            "patterns": [
                "ကျောင်း ပြီး ရင် မည့် သည့် အခွင့်အလမ်း တွေ ရ နိုင် ပါ သလဲ",
                "ဘွဲ့ ရ ပြီး လျှင် မည့် သည့် အလုပ်အကိုင် အခွင့်အလမ်း တွေ ရှိ ပါ သလဲ"
            ],
            "responses": [
                "နည်းပညာ တက္ကသိုလ် (မန္တလေး) သည် မြန်မာနိုင်ငံ ၏ ထိပ်တန်း တက္ကသိုလ် တစ်ခု ဖြစ်သည့် အလျောက် ကျောင်းပြီးသွားလျှင်လည်း သပ်ဆိုင်ရာ မေဂျာအလိုက် အလုပ်အကိုင်များ စွားရှိ ပါ သည်။ ထို့ပြင် အစိုးရအသိ အမှတ်ပြု ဘွဲ့ဖြစ်၍ အစိုးရ ဝန်ထမ်းအဖြစ် လည်းကောင်း ဝင်ရောက်လုပ်ကိုင် နိုင်ပါသည်။ နိုင်ငံခြား ပညာတော်သင် များကိုလည်း ရယူနိုင်ရန် အခွင့်အလမ်းများ ရှိပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "training_period",
            "patterns": [
                "ကျောင်း တက် ရန် အချိန် ကာလ ကို ပြော ပြ ပါ",
                "ကျောင်း ဘယ် နှစ် နှစ် တက် ရ မလဲ",
                "ကျောင်းတက် ကာ လ ဘယ် နှစ် ရှိ သလဲ"
            ],
            "responses": [
                "တက္ကသိုလ် သင်တန်းကာလ (၆) နှစ်ဖြစ်၍ ကျောင်းပြီး သွားသောအခါ Bachelor of Engineering (BE) ဘွဲ့ ရ ရှိမှာ ဖြစ်ပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "after_graduate",
            "patterns": [
                "ကျောင်း ပြီး ရင် ရော ဘယ်လို ဘွဲ့ ရ မလဲ",
                "Master နှင့် Ph.Dရောဆက်တက် လို့ ရ သလား"
            ],
            "responses": [
                "တက္ကသိုလ် သင်တန်းကာလ (၆) နှစ်ဖြစ်၍ ကျောင်းပြီးသွားသောအခါ Bachelor of Engineering (BE) ဘွဲ့ ရ ရှိမှာ ဖြစ်ပါသည်။ ကျောင်းပြီးသွားသူများအနေဖြင့်လည်း Master နှင့် PhD အတန်းများကို ပြည်တွင်း၌သာမက ပြည်ပနိုင်ငံများသို့ပါ သွားရောက် သင်ကြားနိုင်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "scholarship",
            "patterns": [
                "ပညာ ရေး ထူးချွန် တဲ့ ကျောင်းသား တွေ အတွက် ဘယ်လို scholarship အခွင့်အလမ်း တွေ ရှိ ပါ သလဲ",
                "ပညာတော်သင် ထောက်ပံ့ကြေး ပေး တာ ရှိ ပါ သလား",
                "နိုင်ငံခြား scholarship တွေ ရ နိုင် ပါ သလား",
                "scholarship တွေ ရှိ လား"
            ],
            "responses": [
                "ပညာသင်ထောက်ပံ့ကြေး လည်း ရနိုင်သလို ပညာရေး ထူးချွန်သော ကျောင်းသားကျောင်းသူများ အနေဖြင့်လည်း နိုင်ငံခြား Scholarship များကို လျောက်ထားရန် အခွင့်အလမ်းများစွာ ရှိပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "exam",
            "patterns": [
                "စာမေးပွဲ ကို တစ် နှစ် ဘယ် နှစ် ကြိမ်ဖြေဆို ရ လဲ",
                "တစ် နှစ် မှာ စာမေးပွဲ ဘယ် နှစ် ကြိမ် ရှိ ပါ သလဲ",
                "ဘယ်လ တွေ က စာမေးပွဲ လ တွေ လဲ",
                "စာမေးပွဲ"
            ],
            "responses": [
                "စာမေးပွဲ ကို တစ်နှစ်မှာ ၂ ကြိမ် ဖြေဆိုရပါတယ်။ ယေဘုယျအားဖြင့် ပထမနှစ်ဝက်ကို ၃ လပိုင်း အတွင်းမှာ ဖြေဆိုရပြီး ဒုတိယနှစ်ဝက်ကို ၉ လပိုင်း အတွင်း ဖြေဆိုရပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "total_marks",
            "patterns": [
                "ကျောင်းဝင် ခွင့် အမှတ် ပေါင်း ဘယ်လောက် လဲ ။",
                "အမှတ် ဘယ်လောက် လို တာ လဲ ။",
                "အမှတ် ပေါင်း ဘယ်လောက် လို တာ လဲ ။",
                "အမှတ် စာရင်း"
            ],
            "responses": [
                "တစ်နှစ်နှင့်တစ်နှစ်ဆုံးဖြတ်သော အမှတ်ပေါင်းများမတူညီ၍ ယေဘုယျအားဖြင့် (၄)ဘာသာအမှတ်ပေါင်း(၂၈၀)ဖြစ်ပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "holiday",
            "patterns": [
                "စာမေးပွဲ ပြီး ရင် ရော ကျောင်း ပိတ်ရက် က ရော ဘယ်လို ရှိ လဲ",
                "ကျောင်း ပိတ်ရက် က ရော ဘယ်လို ပေး တာ လဲ"
            ],
            "responses": [
                "ယေဘုယျ အနေဖြင့် ကျောင်းပိတ်ရက် ကို ၂လ သတ်မှတ်နိုင်ပါတယ်။ ဒုတိယနှစ်၀က် ဖြေဆိုပြီးလျှင်တော့ ပထမနှစ်၊ ဒုတိယနှစ်နှင့် တတိယနှစ်အတန်းများသည် Field ဆင်းရန် လိုအပ်ပြီး စတုတ္ထနှစ်နှင့် ပဥ္စမနှစ်အတန်းများကတော့ project လုပ်ရန် လိုအပ်ပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "canteen",
            "patterns": [
                "ကျောင်း ကန်တင်း",
                "ကျောင်း ကန်တင်း က အစားအသောက် ကောင်း တွေ ရ သလား",
                "ကျောင်း ကန်တင်း က ကျယ် သလား",
                "ကျောင်း ကန်တင်း ရှိ လား"
            ],
            "responses": [
                "ကျောင်း ကန်တင်း သည် အစားအသောက်များကောင်းမွန်၍ အဆောင် နှစ်ခု ထားရှိ၍ ဆိုင်ခန်းများ ဖွင့်လှစ်ထားကာ ကျယ်ဝန်းသော အနေအထား ရှိပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "library",
            "patterns": [
                "ကျောင်း စာကြည့်တိုက် ရှိ ပါ သလား",
                "ကျောင်း စာကြည့်တိုက် မှာ စာအုပ် တွေ များ များ စားစား ရှိ ပါ သလား",
                "Tum စာကြည့် တိုက် ရှိ သလား",
                "TUMစာကြည့် တိုက် ရှိ သလား",
                "ကျောင်း စာကြည့် တိုက် ရှိ သလား"
            ],
            "responses": [
                "တိတ်တိတ်ဆိတ်ဆိတ်ဖြင့် ကျောင်းသား၊ ကျောင်းသူများ စာကြည့်နိုင်ရန် စာကြည့်တိုက် ရှိပါသည်။ ကျောင်းစာကြည့်တိုက်တွင် သုတ ရသ စာအုပ်များစွာ ရှိပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "environment",
            "patterns": [
                "ကျောင်း မှာ အေးအေးဆေးဆေး စာကြည့် လို့ ကောင်း တဲ့ နေရာ တွေ ရှိ သလား",
                "ကျောင်းပါတ်ဝန်းကျင် က အေးချမ်း သလား"
            ],
            "responses": [
                "ကျောင်းစာကြည့်တိုက်အပြင် အခြားသော အေးအေးဆေးဆေး စာကြည့်လို့ ကောင်းတဲ့ နေရာများစွာ ရှိပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "noanswer",
            "patterns": [],
            "responses": [
                "မေးခွန်းတွက် သင့်တော်သော အဖြေ မပေးနိုင် ၍ ဝမ်းနည်း ပါတယ်။ ကျောင်းသားရေးရာ ဖုန်းနံပါတ် ၀၉-၉၈၈၄၈၄၁၇၂ ကို ဆက်သွယ်၍ အသေးစိတ်ကို မေးမြန်း နိုင်ပါတယ် ။ ",
                "သင့်၏ မေးခွန်း အတွက် အဖြေ မရှိ သော ကြောင့် တောင်းပန် ပါတယ်။"
            ],
            "context": []
        },
        {
            "tag": "teacher",
            "patterns": [
                "ဆရာ ၊ ဆရာမ တွေ က သဘော ကောင်း ကြ လား",
                "ဆရာ ၊ ဆရာမ တွေ သဘော ကောင်း လား"
            ],
            "responses": [
                "ဆရာ၊ဆရာမတွေအားလုံးစာအသင်ပြကောင်း၍သဘောအလွန်ကောင်းကြပါသည်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Civil",
            "patterns": [
                "Civil Engineering မေဂျာ",
                "မြို့ပြ အင်ဂျင်နီယာ မေဂျာ",
                "Civil Engineering အကြောင်းရှင်းပြ ပါ ။"
            ],
            "responses": [
                "Civil Engineeringဟာ မြန်မာလိုဆိုရင် မြို့ပြလို့အဓိပ္ပါယ်ရပြီး လူသားတွေတည်ဆောက်နိုင်တဲ့ ရုပ်ဝတ္ထုယဉ်ကျေးမှုတွေနဲ့အလုံးစုံသက်ဆိုင်ပါတယ်။အဆောက်အအုံတွေဆောက်တာအပြင်၊လမ်းတံတားတွေ၊ဆည်မြောင်းတာတမံတွေ၊‌ရေပေးဝေစနစ်တွေ၊ဥယာဉ်ပန်းခြံတည်ဆောက်မှုတွေဟာမြို့ပြအင်ဂျင်နီယာဆိုင်ရာနယ်ပယ်တွေဖြစ်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Mechanical Engineering",
            "patterns": [
                "Mechanical Engineering မေဂျာ",
                "စက်မှု အင်ဂျင်နီယာ မေဂျာ",
                "Mechanical Engineering အကြောင်းရှင်းပြ ပါ ။"
            ],
            "responses": [
                " စက်မှုအင်ဂျင်နီယာဘာသာရပ်ဟာ Engineering Physics, Mathematics, Materialsနဲ့ Science Principlesတို့ကိုအသုံးပြုပြီး Mechanical Systemsများကို ဒီဇိုင်းဆွဲ၊စစ်‌ဆေး၊ထိန်းသိမ်း၊ထုတ်လုပ်တဲ့ဘာသာရပ်ဖြစ်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Electronic Engineering",
            "patterns": [
                "Electronic Engineering မေဂျာ",
                "အီလက်ထရွန်း အင်ဂျင်နီယာ မေဂျာ",
                "Electronic Engineering အကြောင်းရှင်းပြ ပါ ။",
                "အီလက်ထရောနစ် အင်ဂျင်နီယာ မေဂျာ"
            ],
            "responses": [
                "အီလက်ထရွန်းအင်ဂျင်နီယာဟာ Electronic Circuits, Electronic ပစ္စည်းများကိုတီထွင်ဒီဇိုင်းပြုလုပ်သည့်ဘာသာရပ်ဖြစ်ပါတယ်။ အီလက်ထရွန်းနစ်အင်ဂျင်နီယာဘာသာရပ်မှာ DC(direct current)ကိုအသုံးပြုသည့် Electronic Circuitsများကစပြီး လက်ရှိအသုံးပြုနေသည့်ဆက်သွယ်ရေးနည်းပညာများ၊ အီလက်ထရွန်းနစ်ထိန်းချုပ်စနစ်များ၊ကွန်ပျူတာရဲ့အခြေခံအကြောင်းများ၊ ကွန်ပျူတာချပ်စ်များတီထွင်ထုတ်လုပ်ပုံတို့ကို လေ့လာရမှာဖြစ်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Mechatronic Engineering",
            "patterns": [
                "Mechatronic Engineering မေဂျာ",
                "Mechatronic Engineering အကြောင်းရှင်းပြ ပါ ။",
                "စက်မှု အီလက်ထရောနစ် မေဂျာ"
            ],
            "responses": [
                "Mechanical, electronic, robotic, computer, telecommunication, system, control နဲ့ product ဆိုတဲ့ အင်ဂျင်နီယာဘာသာရပ်အားလုံးကို ပေါင်းစပ်လေ့လာရတဲ့ ဘာသာရပ်ဖြစ်ပြီးပါတယ်။ တစ်နည်းအားဖြင့် ရုပ်ဝတ္တုတွေထဲကို အသိဥာဏ်ထည့်ပေးပြီး ထုတ်လုပ်မှု စွမ်းရည်တိုးတက်အောင် ဖန်တီးရတဲ့ ပညာရပ်ဖြစ်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Chemical Engineering",
            "patterns": [
                "Chemical Engineering မေဂျာ",
                "Chemical Engineering အကြောင်းရှင်းပြ ပါ ။",
                "ဓာတု အင်ဂျင်နီယာ မေဂျာ"
            ],
            "responses": [
                "ဓာတုအင်ဂျင်နီယာဘာသာရပ်ဆိုတာ  Chemistry, Physics, Mathematics, Biology နဲ့ Ecology ဘာသာရပ် တွေရဲ့ စည်းမျဥ်းနိယာမတွေကို အသုံးချရတဲ့ အင်ဂျင်နီယာ ဘာသာရပ် ၁ ခု ဖြစ်ပါတယ်။ အကြီးစားစက်မှုလုပ်ငန်းတွေမှာ nano-technology နဲ့ nano-material တွေကို အသုံးပြုပြီးတော့ ထုတ်ကုန်တွေအဖြစ်လဲ ဖန်တီးနိုင်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Mining Engineering",
            "patterns": [
                "Mining Engineering မေဂျာ",
                "Mining Engineering အကြောင်းရှင်းပြ ပါ ။",
                "သတ္တုတူးဖော် ရေး အင်ဂျင်နီယာ မေဂျာ"
            ],
            "responses": [
                "သတ္တုတူးဖော်ရေးအင်ဂျင်နီယာဆိုတာ‌ကတော့ လူသားတွေအတွက်အကျိုးရှိတဲ့သတ္တုသယံဇာတတွေကိုတူးဖော်ထုတ်ယူရတဲ့ပညာရပ်ပဲဖြစ်ပါတယ်။ ဒီလိုတူးဖော်ဖို့အတွက် သတ္တုကြောတွေရှာဖွေခြင်း၊ သတ္တုတူးဖော်ဖို့အတွက်ပြင်ဆင်ခြင်း၊ သတ္တုတွင်းလုပ်သားတွေနဲ့မိသားစုတွေအတွက် Mine Town တည်ဆောက်ခြင်း၊ သဘာဝပတ်ဝန်းကျင်ထိခိုင်မှုအနည်းဆုံးဖြစ်အောင်ပြင်ဆင်ခြင်း၊ သတ္တုတူးဖော်ပြီးတဲ့နောက်မှာတူးဖော်ခဲ့တဲ့ဒေသအတွက်အကျိုးပြုလုပ်ငန်းတွေဆောင်ရွက်ခြင်း စတာတွေကိုလေ့လာရပါတယ်။ တခြားဆက်စပ်လေ့လာရတဲ့နယ်ပယ်တွေကတော့ Geology, Geotechnical, Economic, Project Management, Environmental, Sustainability, Electrical, Mechanical, Tunneling နဲ့ Mine Safety ပညာရပ်တွေပဲဖြစ်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Petroleum Engineering",
            "patterns": [
                "Petrol",
                "Petroleum Engineering မေဂျာ",
                "Petroleum Engineering အကြောင်းရှင်းပြ ပါ ။",
                "ရေနံ အင်ဂျင်နီယာ မေဂျာ"
            ],
            "responses": [
                "ရေနံအင်ဂျင်နီယာဆိုတာကတော့ ကမ္ဘာ‌ေမြပြင်နဲ့သမုဒ္ဒရာကြမ်းပြင်အောက်မှာရှိတဲ့ရေနံကြောနဲ့သဘာဝဓာတ်ငွေ့သိုက်တွေကိုရှာဖွေခြင်း၊ ရှာဖွေတွေ့ရှိတဲ့အခါမှာတူးဖော်ဖို့ရေနံတွင်းတွေတည်ဆောက်ခြင်း၊ ရေနံတွင်းတည်ဆောက်ပြီးတဲ့အခါမှာမှန်ကန်တဲ့နည်းလမ်းနဲ့တူးဖော်ထုတ်ယူခြင်း၊ သဘာဝဓာတ်ငွေ့ကနေ ရေနံကိုစစ်ထုတ်ယူခြင်း စတာတွေကိုလေ့လာရတဲ့ပညာရပ်ဖြစ်ပါတယ်။ဒါ့အပြင်ဆက်စပ်နယ်ပယ်တွေဖြစ်တဲ့ စက်မှုဆိုင်ရာ၊ လျှပ်စစ်ဆိုင်ရာ၊ ဓာတုဆိုင်ရာ၊ ဆောက်လုပ်ရေး၊ ပို့ဆောင်ဆက်သွယ်ရေး၊ စီးပွားရေး၊ ရေနံလုပ်ငန်းခွင်အန္တရာယ်ကင်းရှင်းရေး၊ သဘာဝပတ်ဝန်းကျင်ထိန်းသိမ်းစောင့်ရှောက်ရေး စတာတွေကိုလည်းခြုံငုံမိအောင်လေ့လာရပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Information Technology",
            "patterns": [
                "IT",
                "it",
                "သုတ နည်း ပညာ မေဂျာ",
                "Information Technology မေဂျာ",
                "Information Technology အကြောင်းရှင်းပြ ပါ ။",
                "Infrmaiton Technology ဆို တာ ဘာ လဲ ။"
            ],
            "responses": [
                "Information Technology (IT) မှာဆိုရင် Networking, programming, software engineering, embedded system,image processing စတဲ့ ဘာသာရပ်တွေ fieldတွေအပြင် ကွန်ပျူတာ hardware /softwareနဲ့ပတ်သက်တာတွေ project managementတွေ အကုန်သင်ရပါတယ်"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Architecture",
            "patterns": [
                "Archi",
                "Architecture မေဂျာ",
                "Architecture အကြောင်းရှင်းပြ ပါ ။",
                "ဗိသုကာ ပညာ မေဂျာ"
            ],
            "responses": [
                "ဗိသုကာပညာရပ်ဟာအဆောက်အဦးဒီဇိုင်းများကိုတီထွင်သည့်အနုပညာအတတ်ပညာသာမကအဆောက်အဦးနှင့်လိုက်လျောညီထွေမည့်အဆောက်အဦးပြင်ပမြေယာပြုပြင်မှုများ နဲ့ နောက်ဆုံးမြို့ပြတည်ဆောက်ခြင်းများအထိလေ့လာရတဲ့ဘာသာရပ်ဖြစ်ပါတယ်။"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Electrical Power",
            "patterns": [
                "Electrical Power မေဂျာ",
                "Electrical Power အကြောင်းရှင်းပြ ပါ ။",
                "EP",
                "လျှပ်စစ်စွမ်းအား အင်ဂျင်နီယာ မေဂျာ"
            ],
            "responses": [
                "လျှပ်စစ်စွမ်းအားအင်ဂျင်နီယာဆိုတာကတော့ လျှပ်စစ်ဓာတ်အားကိုဘယ်လိုထုတ်ယူမလဲ၊ တစ်နေရာကနေတစ်နေရာကိုဘယ်လိုပို့ဆောင်မလဲ၊ ဘယ်လိုဖြန့်ဖြူးမလဲဆိုတဲ့အကြောင်းအရာတွေကို လေ့လာရတဲ့ပညာရပ်ဖြစ်ပါတယ်။ဒီလိုထုတ်လုပ်၊ဖြန့်ဖြူးတဲ့နေရာမှာအသုံးပြုတဲ့Mortorတို့၊ Transformerတို့လို Electrical Machineတွေရဲ့ အကြောင်းအရာတွေကိုလည်းလေ့လာရပါတယ်။"
            ],
            "context": [
                ""
            ]
        }
    ]
}